app/views/menus/_form.html.erb

    <%= f.label :restaurant_id %><br>
    <%= f.select :restaurant_id, Restaurant.all.collect {|x| [x.name , x.id]} , {:include_blank => "Select One..."} %>
---
SELECT `restaurants`.* FROM `restaurants`