app/views/restaurants/show.html.erb

      <table class="table">
        <% menu.items.each do |item| %>
---
SELECT `items`.* FROM `items` WHERE `items`.`menu_id` = 1