app/views/restaurants/show.html.erb

  <ul>
    <% @restaurant.menus.each do |menu|%>
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`restaurant_id` = 1

    <div class="row">
      <% @restaurant.tables.each do |table|%>
---
SELECT `tables`.* FROM `tables` WHERE `tables`.`restaurant_id` = 1