app/views/items/_form.html.erb

SELECT `menus`.* FROM `menus`
---
    <%= f.label :menu_id %><br>
    <%= f.select :menu_id, Menu.all.collect {|x| [x.title , x.id]} , {:include_blank => "Select One..."} %>