app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT `carts`.* FROM `carts`

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1