app/controllers/items_controller.rb

INSERT INTO `items` (`title`, `description`, `image_url`, `price`, `created_at`, `updated_at`) VALUES ('Paneer Tikka Masala', 'Tasty', 'panetikkamasala.png', 9.75, '2015-10-22 01:38:30', '2015-10-22 01:38:30')
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE `items` SET `image_file_name` = 'item1.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 574277, `image_updated_at` = '2015-11-02 01:18:33', `updated_at` = '2015-11-02 01:18:34' WHERE `items`.`id` = 3
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM `items` WHERE `items`.`id` = 4
---
  def destroy
    @item.destroy

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 4 LIMIT 1
---
    def set_item
      @item = Item.find(params[:id])