app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT `line_items`.* FROM `line_items`

  def create
    item = Item.find(params[:item_id])
    @line_item = @cart.add_product(item.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2015-10-28 07:07:36', '2015-10-28 07:07:36')
INSERT INTO `line_items` (`item_id`, `cart_id`, `created_at`, `updated_at`) VALUES (1, 1, '2015-10-28 07:07:36', '2015-10-28 07:07:36')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2015-10-28 07:44:18' WHERE `line_items`.`id` = 5

  def destroy
    @line_item.destroy
---
DELETE FROM `line_items` WHERE `line_items`.`id` = 1

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT  `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 1 LIMIT 1