app/controllers/menus_controller.rb

SELECT `menus`.* FROM `menus`
---
  def index
    @menus = Menu.all

INSERT INTO `menus` (`restaurant_id`, `title`, `description`, `created_at`, `updated_at`) VALUES (1, 'Appetizers', 'Light food', '2015-11-02 00:46:30', '2015-11-02 00:46:30')
---
  def create
    @menu = Menu.new(menu_params)

    respond_to do |format|
      if @menu.save