app/controllers/restaurants_controller.rb

SELECT `restaurants`.* FROM `restaurants`
---
  def index

    if params[:search_name] or params[:search_city] or params[:search_zip_code]
      if not params[:search_name]
        search_name_field = '%'
      else
        search_name_field = params[:search_name]
      end
      if not params[:search_city]
        search_city_field = '%'
      else
        search_city_field = params[:search_city]
      end
      if not params[:search_zip_code]
        search_zip_code_field = '%'
      else
        search_zip_code_field = params[:search_zip_code]
      end
      @restaurants = Restaurant.search(search_name_field, search_city_field, search_zip_code_field).paginate(page: params[:page], per_page: 5)

SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
  def show
    @restaurant = Restaurant.find(params[:id])

INSERT INTO `restaurants` (`name`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `description`, `address`, `city`, `zip_code`, `tell`, `owner_id`, `created_at`, `updated_at`) VALUES ('ABC', 'res1.jpg', 'image/jpeg', 5199309, '2015-11-01 21:24:58', 'This that', 'Westwood', 'LA', 90024, '424882823', 1, '2015-11-01 21:25:01', '2015-11-01 21:25:01')
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.owner_id = current_owner.id

    respond_to do |format|
      if @restaurant.save

SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
    def set_restaurant
      @restaurant = Restaurant.find(params[:id])