app/controllers/tables_controller.rb

SELECT `tables`.* FROM `tables`
---
  def index
    @tables = Table.all